README.org
#+TITLE: Emacs Configuration
#+AUTHOR: desktop
#+STARTUP: overview
#+PROPERTY: header-args:emacs-lisp :tangle no :lexical t :results silent


To tangle: =C-c C-v t= or =M-x org-babel-tangle=.

Files produced:
- =~/.emacs.d/early-init.el=
- =~/.emacs.d/init.el=

*Important*: All packages are installed via Nix/home-manager. Every =use-package=
declaration uses =:ensure nil=. Do not add =:straight t= or =:ensure t= here.

* Early Init
:PROPERTIES:
:header-args:emacs-lisp: :tangle early-init.el
:END:

=early-init.el= runs before the package system and UI initialize.
We use it for GC/IGC tuning, disabling =package.el=, and stripping
UI chrome before frames are drawn.

#+begin_src emacs-lisp
  ;;; early-init.el --- Early initialization -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;; Tangled from config.org — do not edit by hand.
  ;;; Code:
#+end_src

** Garbage Collection and IGC

We run on the IGC (incremental garbage collector) branch. Crank GC
thresholds sky-high during init, then reset. IGC-specific knobs
control step size and threshold separately.

#+begin_src emacs-lisp
  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.6)

  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-threshold (* 16 1024 1024)
                    gc-cons-percentage 0.1)))

  ;; IGC tuning (ignored on non-IGC builds)
  (setq igc-step-multiplier 2)
  (setq igc-cons-threshold (* 32 1024 1024))

  (add-hook 'focus-out-hook #'garbage-collect)
#+end_src

** Directory Structure

Keep all runtime state under =~/.emacs.d/var/= so the config root
stays clean.

#+begin_src emacs-lisp
  (setq user-emacs-directory (expand-file-name "var/" "~/.emacs.d/"))
  (unless (file-directory-p user-emacs-directory)
    (make-directory user-emacs-directory t))
#+end_src

** Disable package.el

Nix manages every package. =package.el= has nothing to do.

#+begin_src emacs-lisp
  (setq package-enable-at-startup nil)
  (setq package-archives nil)
#+end_src

** Native Compilation

Let JIT compilation happen in the background. Redirect the eln-cache
into our var directory.

#+begin_src emacs-lisp
  (when (featurep 'native-compile)
    (setq native-comp-deferred-compilation t
          native-comp-jit-compilation t
          native-comp-async-report-warnings-errors 'silent
          native-comp-warning-on-missing-source nil)
    (when (fboundp 'startup-redirect-eln-cache)
      (startup-redirect-eln-cache
       (expand-file-name "eln-cache/" user-emacs-directory))))
#+end_src

** UI Chrome

Strip toolbars, scrollbars, and menu before the first frame draws.
This avoids the flash of default UI.

#+begin_src emacs-lisp
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)
  (push '(horizontal-scroll-bars) default-frame-alist)

  (setq menu-bar-mode nil
        tool-bar-mode nil
        scroll-bar-mode nil)
#+end_src

** Frame and Startup

#+begin_src emacs-lisp
  (setq frame-resize-pixelwise t
        frame-inhibit-implied-resize t
        frame-title-format '("%b – Emacs")
        icon-title-format frame-title-format)

  (setq inhibit-startup-screen t
        inhibit-startup-echo-area-message user-login-name
        inhibit-startup-buffer-menu t
        initial-scratch-message nil
        initial-major-mode 'fundamental-mode)
#+end_src

** Misc Performance

#+begin_src emacs-lisp
  (setq auto-mode-case-fold nil
        read-process-output-max (* 1024 1024 4))

  (setq idle-update-delay 1.0
        inhibit-compacting-font-caches t
        ffap-machine-p-known 'reject)

  (setq-default bidi-display-reordering 'left-to-right
                bidi-paragraph-direction 'left-to-right)

  (set-language-environment "UTF-8")
  (setq default-input-method nil)
#+end_src

** Custom File

#+begin_src emacs-lisp
  (setq custom-file (expand-file-name "custom.el" "~/.emacs.d/"))

  (provide 'early-init)
  ;;; early-init.el ends here
#+end_src

* Init
:PROPERTIES:
:header-args:emacs-lisp: :tangle init.el
:END:

Everything from here forward tangles into =init.el=.

#+begin_src emacs-lisp
  ;;; init.el --- Main configuration -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;; Tangled from config.org — do not edit by hand.
  ;; Based on Emacs-Kick by Rahul Martim Juliato, adapted for NixOS + IGC + Sway.
  ;;; Code:
#+end_src

** Bootstrap

Nix provides all packages on the load-path already. We just need
=use-package= (built-in since Emacs 29) and tell it never to install
anything.

#+begin_src emacs-lisp
  (setq package-archives nil)
  (setq package-enable-at-startup nil)

  (require 'package)
  (package-initialize)
  (require 'use-package)
  (setq use-package-always-ensure nil)
#+end_src

** File Paths

Keep all generated state under =var/=.

#+begin_src emacs-lisp
  (setq custom-file (expand-file-name "custom.el" "~/.emacs.d/"))
  (when (file-exists-p custom-file)
    (load custom-file :noerror :nomessage))

  (setq auto-save-list-file-prefix (expand-file-name "autosave/" user-emacs-directory))
  (setq backup-directory-alist `(("." . ,(expand-file-name "backup" user-emacs-directory))))
  (setq recentf-save-file (expand-file-name "recentf" user-emacs-directory))
  (setq save-place-file (expand-file-name "saveplace" user-emacs-directory))
  (setq savehist-file (expand-file-name "history" user-emacs-directory))
  (setq project-list-file (expand-file-name "projects.eld" user-emacs-directory))
  (setq transient-history-file (expand-file-name "transient/history.el" user-emacs-directory))
  (setq transient-levels-file (expand-file-name "transient/levels.el" user-emacs-directory))
  (setq transient-values-file (expand-file-name "transient/values.el" user-emacs-directory))
  (setq abbrev-file-name (expand-file-name "abbrev_defs" user-emacs-directory))
#+end_src

* Core Emacs
:PROPERTIES:
:header-args:emacs-lisp: :tangle init.el
:END:

** Defaults

#+begin_src emacs-lisp
  (use-package emacs
    :ensure nil
    :custom
    (auto-save-default nil)
    (auto-revert-use-notify nil)
    (column-number-mode t)
    (create-lockfiles nil)
    (delete-by-moving-to-trash t)
    (delete-selection-mode 1)
    (global-auto-revert-mode 1)
    (inhibit-startup-message t)
    (make-backup-files nil)
    (pixel-scroll-precision-mode t)
    (ring-bell-function 'ignore)
    (split-width-threshold 170)
    (tab-width 4)
    (treesit-font-lock-level 4)
    (use-short-answers t)
    (blink-cursor-mode nil)

    :hook
    (prog-mode . display-line-numbers-mode)

    :config
    (let ((mono-font "FiraCode Nerd Font")
          (sans-font "DejaVu Sans"))
      (set-face-attribute 'default nil :family mono-font :weight 'semi-bold :height 180)
      (set-face-attribute 'fixed-pitch nil :family mono-font :weight 'semi-bold :height 180)
      (set-face-attribute 'variable-pitch nil :family sans-font :height 180))

    (defun skip-these-buffers (_window buffer _bury-or-kill)
      "Function for `switch-to-prev-buffer-skip'."
      (string-match "\\*[^*]+\\*" (buffer-name buffer)))
    (setq switch-to-prev-buffer-skip 'skip-these-buffers)

    (setq custom-file (locate-user-emacs-file "custom-vars.el"))
    (load custom-file 'noerror 'nomessage)

    (set-display-table-slot standard-display-table 'vertical-border (make-glyph-code ?│))
    (modify-coding-system-alist 'file "" 'utf-8)

    :init
    (tool-bar-mode -1)
    (menu-bar-mode -1)
    (when scroll-bar-mode (scroll-bar-mode -1))
    (global-hl-line-mode 1)
    (global-auto-revert-mode 1)
    (recentf-mode 1)
    (savehist-mode 1)
    (save-place-mode 1)
    (winner-mode 1)
    (repeat-mode 1)
    (file-name-shadow-mode 1)

    (setq compilation-scroll-output t)
    (add-hook 'compilation-filter-hook 'ansi-color-compilation-filter)

    (add-hook 'after-init-hook
              (lambda ()
                (with-current-buffer (get-buffer-create "*scratch*")
                  (insert (format ";;    Welcome to Emacs!\n;;\n;;    Loading time : %s\n"
                                  (emacs-init-time)))))))
#+end_src

** Window Display Rules

#+begin_src emacs-lisp
  (use-package window
    :ensure nil
    :custom
    (display-buffer-alist
     '(("\\*\\(Backtrace\\|Warnings\\|Compile-Log\\|[Hh]elp\\|Messages\\|Bookmark List\\|Ibuffer\\|Occur\\|eldoc.*\\)\\*"
        (display-buffer-in-side-window)
        (window-height . 0.25)
        (side . bottom)
        (slot . 0))
       ("\\*\\(Flymake diagnostics\\|xref\\|Completions\\)\\*"
        (display-buffer-in-side-window)
        (window-height . 0.25)
        (side . bottom)
        (slot . 1)))))
#+end_src

** Dired

#+begin_src emacs-lisp
  (use-package dired
    :ensure nil
    :custom
    (dired-listing-switches "-agho --group-directories-first")
    (dired-dwim-target t)
    (dired-kill-when-opening-new-dired-buffer t)
    (dired-recursive-copies 'always)
    (dired-recursive-deletes 'always)
    :hook
    ((dired-mode . dired-hide-details-mode)
     (dired-mode . hl-line-mode)))

  (use-package dired-subtree
    :ensure nil
    :after dired
    :bind (:map dired-mode-map
                ("<tab>" . dired-subtree-toggle)
                ("<backtab>" . dired-subtree-remove)))
#+end_src

** Isearch

#+begin_src emacs-lisp
  (use-package isearch
    :ensure nil
    :config
    (setq isearch-lazy-count t
          lazy-count-prefix-format "(%s/%s) "
          lazy-count-suffix-format nil
          search-whitespace-regexp ".*?")
    :bind (("C-s" . isearch-forward)
           ("C-r" . isearch-backward)))
#+end_src

** Eldoc

#+begin_src emacs-lisp
  (use-package eldoc
    :ensure nil
    :diminish
    :custom
    (eldoc-idle-delay 0.5)
    (eldoc-echo-area-use-multiline-p nil)
    (eldoc-echo-area-display-truncation-message nil)
    :init
    (global-eldoc-mode))
#+end_src

** Flymake

#+begin_src emacs-lisp
  (use-package flymake
    :ensure nil
    :defer t
    :hook (prog-mode . flymake-mode)
    :custom
    (flymake-margin-indicators-string
     '((error "!»" compilation-error)
       (warning "»" compilation-warning)
       (note "»" compilation-info)))
    :config
    (put 'flymake-goto-next-error 'repeat-map 'flymake-repeat-map)
    (put 'flymake-goto-prev-error 'repeat-map 'flymake-repeat-map)
    (defun consult-flymake-project ()
      "Jump to Flymake diagnostic in project."
      (interactive)
      (consult-flymake t))
    :bind (:map flymake-mode-map
                ("C-c e e" . consult-flymake)
                ("C-c e l" . consult-flymake-project)
                ("C-c e n" . flymake-goto-next-error)
                ("C-c e p" . flymake-goto-prev-error)))
#+end_src

** Org Mode

#+begin_src emacs-lisp
  (use-package org
    :ensure nil
    :defer t
    :custom
    (org-M-RET-may-split-line '((default . nil)))
    (org-insert-heading-respect-content t)
    (org-return-follows-link t)
    (org-log-done 'time)
    (org-log-into-drawer t)
    (org-directory "~/Sync/personal/")
    (org-default-notes-file (expand-file-name "inbox.org" org-directory))
    :hook
    ((org-mode . org-indent-mode)
     (org-mode . auto-save-mode))
    :bind ("C-c c" . org-capture))

  (use-package org-appear
    :ensure nil
    :hook (org-mode . org-appear-mode))
#+end_src

** Which-Key

#+begin_src emacs-lisp
  (use-package which-key
    :ensure nil
    :defer t
    :custom
    (which-key-idle-delay 1.0)
    :diminish
    :hook (after-init . which-key-mode))
#+end_src

** Smerge

#+begin_src emacs-lisp
  (use-package smerge-mode
    :ensure nil
    :defer t
    :bind (:map smerge-mode-map
                ("C-c ^ u" . smerge-keep-upper)
                ("C-c ^ l" . smerge-keep-lower)
                ("C-c ^ n" . smerge-next)
                ("C-c ^ p" . smerge-previous)))
#+end_src

* Completion
:PROPERTIES:
:header-args:emacs-lisp: :tangle init.el
:END:

** Vertico

#+begin_src emacs-lisp
  (use-package vertico
    :ensure nil
    :hook (after-init . vertico-mode)
    :custom
    (vertico-count 10)
    (vertico-resize nil)
    (vertico-cycle nil)
    :bind (:map vertico-map
                ("RET" . vertico-directory-enter)
                ("DEL" . vertico-directory-delete-char)
                ("M-DEL" . vertico-directory-delete-word))
    :config
    (advice-add #'vertico--format-candidate :around
                (lambda (orig cand prefix suffix index _start)
                  (setq cand (funcall orig cand prefix suffix index _start))
                  (concat
                   (if (= vertico--index index)
                       (propertize "» " 'face '(:foreground "#80adf0" :weight bold))
                     "  ")
                   cand))))
#+end_src

** Orderless

#+begin_src emacs-lisp
  (use-package orderless
    :ensure nil
    :after vertico
    :custom
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles partial-completion)))))
#+end_src

** Marginalia

#+begin_src emacs-lisp
  (use-package marginalia
    :ensure nil
    :hook (after-init . marginalia-mode))
#+end_src

** Consult

#+begin_src emacs-lisp
  (use-package consult
    :ensure nil
    :defer t
    :bind (("C-x b"   . consult-buffer)
           ("M-y"     . consult-yank-pop)
           ("M-g g"   . consult-goto-line)
           ("M-g i"   . consult-imenu)
           ("M-s r"   . consult-ripgrep)
           ("M-s l"   . consult-line)
           ("M-s g"   . consult-grep))
    :init
    (advice-add #'register-preview :override #'consult-register-window)
    (setq xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref))
#+end_src

